app/controllers/client_controller.rb

SELECT "clients".* FROM "clients" ORDER BY created_at DESC
---
    def index
      clients = Client.order('created_at DESC');